# Data Processing

I will first try and read in the datasets for all years (bar 2008 for now).
I found that the locations are in columns and this requires pivots to fix so I won't write a loop but rather pivot individually first.

I did not include dcc-footfall-counter-locations-14082020.csv in this process as it contains data which will be redundantly repeated in each row if it were joined to our merged footfall counter dataframe.

In [2]:
!pip install odfpy
!pip install xlrd
!pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: odfpy in c:\users\owner#\appdata\roaming\python\python38\site-packages (1.4.1)
Requirement already satisfied: defusedxml in c:\program files\python38\lib\site-packages (from odfpy) (0.6.0)
Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: xlrd in c:\users\owner#\appdata\roaming\python\python38\site-packages (1.2.0)
Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.0.5-py2.py3-none-any.whl (242 kB)
Collecting et-xmlfile
  Downloading et_xmlfile-1.0.1.tar.gz (8.4 kB)
Collecting jdcal
  Downloading jdcal-1.4.1-py2.py3-none-any.whl (9.5 kB)
Using legacy 'setup.py install' for et-xmlfile, since package 'wheel' is not installed.
Installing collected packages: et-xmlfile, jdcal, openpyxl
    Running setup.py install for et-xmlfile: started
    Running setup.py install for et-xmlfile: finished with status 'done'
Successfully installed et-xmlfile-1.0.1 jdcal-1.4.1 openpyxl-3.0.5

In [2]:
import pandas as pd
import numpy as np

In [3]:
# 2020
jan_jun2020 = pd.read_csv('../data/raw/a3-2020-jan-jun.csv')
jul_sep2020 = pd.read_csv('../data/raw/a3-2020-jul-sep.csv')

# 2019
jan_jun2019 = pd.read_excel('../data/raw/a3-2019-jan-jun.xlsx')
jul_dec2019 = pd.read_excel('../data/raw/a3-2019-Jul-Dec.xlsx')

# 2010
whole_2010 = pd.read_json('../data/raw/a3-2010.json')

# 2008
fixed_2008 = pd.read_csv('../data/processed/a3-2008-fixed.csv')

In [4]:
whole_2010 = whole_2010.rename(columns={"Unnamed: 0": "Date and Time"})

In [5]:
# loads of NaN's
jan_jun2019.head()

,Time,O'Connell St Outside Pennys,O'Connell St Outside Clerys,Mary Street,Capel Street,Aston Quay,Grafton Street @ CompuB,Talbot Street North,"Doilier Street, Burgh Quay",Dawson Street Replacement,...,"College Green, Bank Of Ireland",Henry Street,Westmoreland Street East,Dawson Street,Liffey Street,Westmoreland Street West,Grafton Street,Bachelors Walk,College Green @ Church Lane,College Green - Dame St Side
0,2019-01-01 00:00:00,244,1914.0,20,16,NaN,NaN,NaN,NaN,NaN,...,NaN,95,1670.0,255.0,881.0,1988.0,140.0,NaN,NaN,NaN
1,2019-01-01 00:15:00,454,NaN,24,62,NaN,NaN,NaN,NaN,NaN,...,NaN,265,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2019-01-01 00:30:00,391,NaN,69,99,NaN,NaN,NaN,NaN,NaN,...,NaN,117,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2019-01-01 00:45:00,415,NaN,50,61,NaN,NaN,NaN,NaN,NaN,...,NaN,120,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2019-01-01 01:00:00,319,885.0,24,47,NaN,NaN,NaN,NaN,NaN,...,NaN,90,767.0,209.0,723.0,1270.0,215.0,NaN,NaN,NaN

Pivoting the location columns into single column

In [6]:
fixed_2008.drop(columns=["Unnamed: 0"], inplace=True)

In [7]:
fixed_2008.head()

,Date and Time,O'Connell St Outside Clerys,Grafton St at Card Gallery,O'Connell Street at Easons,Henry Street at Butlers,Grafton Street at Korkys
0,2008-01-07 00:00:00,0,0,0,0,0
1,2008-01-07 01:00:00,0,0,0,0,0
2,2008-01-07 02:00:00,0,0,0,0,0
3,2008-01-07 03:00:00,0,0,0,0,0
4,2008-01-07 04:00:00,0,0,0,0,0

In [8]:
jan_jun2020 = jan_jun2020.melt(id_vars=["Date and Time"], 
        var_name="Location", 
        value_name="Count")

jul_sep2020 = jul_sep2020.melt(id_vars=["Date and Time"], 
        var_name="Location", 
        value_name="Count")

jan_jun2019 = jan_jun2019.melt(id_vars=["Time"], 
        var_name="Location", 
        value_name="Count")

jul_dec2019 = jul_dec2019.melt(id_vars=["Time"], 
        var_name="Location", 
        value_name="Count")

whole_2010 = whole_2010.melt(id_vars=['Date and Time'],
                            var_name="Location",
                            value_name="Count")

fixed_2008 = fixed_2008.melt(id_vars=['Date and Time'],
                            var_name="Location",
                            value_name="Count")

In [9]:
fixed_2008.head(10)

         Date and Time                     Location  Count
0  2008-01-07 00:00:00  O'Connell St Outside Clerys      0
1  2008-01-07 01:00:00  O'Connell St Outside Clerys      0
2  2008-01-07 02:00:00  O'Connell St Outside Clerys      0
3  2008-01-07 03:00:00  O'Connell St Outside Clerys      0
4  2008-01-07 04:00:00  O'Connell St Outside Clerys      0
5  2008-01-07 05:00:00  O'Connell St Outside Clerys      0
6  2008-01-07 06:00:00  O'Connell St Outside Clerys      0
7  2008-01-07 07:00:00  O'Connell St Outside Clerys      0
8  2008-01-07 08:00:00  O'Connell St Outside Clerys      0
9  2008-01-07 09:00:00  O'Connell St Outside Clerys      0

Mary Street is full of NaN's, I would rather deal with all the NaNs with the concatenated dataframe.

In [10]:
tmp = jul_sep2020[jul_sep2020.Location == "Mary Street"]
tmp.isna().sum()

Date and Time       0
Location            0
Count            2927
dtype: int64

In [11]:
jul_dec2019.head()

                 Time                     Location  Count
0 2019-07-01 00:00:00  O'Connell St Outside Pennys   81.0
1 2019-07-01 00:15:00  O'Connell St Outside Pennys   63.0
2 2019-07-01 00:30:00  O'Connell St Outside Pennys   60.0
3 2019-07-01 00:45:00  O'Connell St Outside Pennys   61.0
4 2019-07-01 01:00:00  O'Connell St Outside Pennys   36.0

#### Merging the dataframe

In [12]:
# making sure datetime column has common name
corrections = {"Time": "Date and Time"}
jan_jun2019 = jan_jun2019.rename(columns=corrections)
jul_dec2019 = jul_dec2019.rename(columns=corrections)

In [13]:
df = pd.concat([fixed_2008, whole_2010, jan_jun2019, jul_dec2019, jan_jun2020, jul_sep2020])

In [14]:
# Write new dataframe into csv file for efficient retrieval
df.to_csv('../data/processed/footfall.csv', index=False)

In [15]:
df = pd.read_csv('../data/processed/footfall.csv', low_memory=False)

In [16]:
df.dtypes

Date and Time    object
Location         object
Count            object
dtype: object

The merge appears to have worked. My next task is grouping the times so that each count is hourly.

# Data Cleaning

1. Found "O" as a 0 in count column

In [17]:
df[df['Count'] == "O"]

          Date and Time                    Location Count
48337  09/06/2010 01:00  O'Connell Street at Clerys     O

In [18]:
df.iloc[48337, 2] = 0

2. Some NaN values in the count column. I will drop these rows. A NaN in any other column would also be troublesome so I will remove any row with a NaN.

In [19]:
df.shape

(1070164, 3)

In [20]:
df = df.dropna(how="any")

In [21]:
df.shape

(783339, 3)

3. Blank values in count column.

Fixed in OpenRefine. Details in cleaning.md. Read out most recent version to OpenRefine.

In [22]:
df.to_csv('../data/processed/footfall.csv', index=False)

4. Multiple naming conventions for same locations.

Fixed in OpenRefine. Details in cleaning.md

In [23]:
#reading in refined dataset
df = pd.read_csv("../data/processed/footfall-refined.csv")

5. Check for duplicates

In [24]:
df[df.duplicated(keep=False)].sort_values(by=["Date and Time", "Location"]).head(6)

           Date and Time        Location  Count
652878  01/06/2020 00:00      Aston Quay  333.0
734734  01/06/2020 00:00      Aston Quay  333.0
716496  01/06/2020 00:00  Bachelors Walk    3.0
774547  01/06/2020 00:00  Bachelors Walk    3.0
648511  01/06/2020 00:00    Capel Street   44.0
731806  01/06/2020 00:00    Capel Street   44.0

In [25]:
df.shape

(783331, 3)

In [26]:
df.drop_duplicates(keep="first", inplace=True)

In [27]:
df.shape

(768931, 3)

6. Fix types

In [28]:
# autoformatting datetimes here
df['Date and Time'] = pd.to_datetime(df['Date and Time'])
df['Count'] = df['Count'].astype("int64")

In [29]:
df.dtypes

Date and Time    datetime64[ns]
Location                 object
Count                     int64
dtype: object

In [30]:
df.head()

        Date and Time                     Location  Count
0 2008-01-07 00:00:00  O'Connell St Outside Clerys      0
1 2008-01-07 01:00:00  O'Connell St Outside Clerys      0
2 2008-01-07 02:00:00  O'Connell St Outside Clerys      0
3 2008-01-07 03:00:00  O'Connell St Outside Clerys      0
4 2008-01-07 04:00:00  O'Connell St Outside Clerys      0

#### 7. setting hourly counts

I came across difficulty here as I wasn't sure how to group the rows by hour and location, get the sums and revert back to dataframe without getting a groupby object which is not a dataframe.

In [50]:
# control, check that 2019-01-01 00:00:00, O'Connel St Outside Penneys = 1504

# find index first
df[(df.Location == "O'Connell St Outside Pennys") &
          (df["Date and Time"] == "2019-01-01 00:00:00")].index

print("Hour total: {}".format(df.iloc[96942:96946, 2].sum()))

Hour total: 1504

In [51]:
hourly_df = df.groupby([pd.Grouper(key='Date and Time', freq='H'), 'Location']).sum()

In [52]:
print(hourly_df.shape)
print(hourly_df.index)
hourly_df.head()

(404961, 1)
MultiIndex([('2008-01-07 00:00:00',     'Grafton St at Card Gallery'),
            ('2008-01-07 00:00:00',       'Grafton Street at Korkys'),
            ('2008-01-07 00:00:00',        'Henry Street at Butlers'),
            ('2008-01-07 00:00:00',    'O'Connell St Outside Clerys'),
            ('2008-01-07 00:00:00',     'O'Connell Street at Easons'),
            ('2008-01-07 01:00:00',     'Grafton St at Card Gallery'),
            ('2008-01-07 01:00:00',       'Grafton Street at Korkys'),
            ('2008-01-07 01:00:00',        'Henry Street at Butlers'),
            ('2008-01-07 01:00:00',    'O'Connell St Outside Clerys'),
            ('2008-01-07 01:00:00',     'O'Connell Street at Easons'),
            ...
            ('2020-12-09 23:00:00',       'Grafton Street at CompuB'),
            ('2020-12-09 23:00:00',                   'Henry Street'),
            ('2020-12-09 23:00:00',                  'Liffey Street'),
            ('2020-12-09 23:00:00',    'O'Connell St Outside Clerys'),
            ('2020-12-09 23:00:00',    'O'Connell St Outside Pennys'),
            ('2020-12-09 23:00:00', 'O'Connell St Parnell St at AIB'),
            ('2020-12-09 23:00:00',            'Talbot Street North'),
            ('2020-12-09 23:00:00',            'Talbot Street South'),
            ('2020-12-09 23:00:00',       'Westmoreland Street East'),
            ('2020-12-09 23:00:00',       'Westmoreland Street West')],
           names=['Date and Time', 'Location'], length=404961)

                                           Count
Date and Time Location
2008-01-07    Grafton St at Card Gallery       0
              Grafton Street at Korkys         0
              Henry Street at Butlers          0
              O'Connell St Outside Clerys      0
              O'Connell Street at Easons       0

The object above is essentially what I want but I would like it without Multi Index.

In [53]:
hourly_df.reset_index(inplace=True)

In [54]:
hourly_df.head(7)

        Date and Time                     Location  Count
0 2008-01-07 00:00:00   Grafton St at Card Gallery      0
1 2008-01-07 00:00:00     Grafton Street at Korkys      0
2 2008-01-07 00:00:00      Henry Street at Butlers      0
3 2008-01-07 00:00:00  O'Connell St Outside Clerys      0
4 2008-01-07 00:00:00   O'Connell Street at Easons      0
5 2008-01-07 01:00:00   Grafton St at Card Gallery      0
6 2008-01-07 01:00:00     Grafton Street at Korkys      0

In [55]:
# Now check the control
# (check that 2019-01-01 00:00:00, O'Connel St Outside Penneys = 1504)
hourly_df[(hourly_df.Location == "O'Connell St Outside Pennys") &
           (hourly_df["Date and Time"] == "2019-01-01 00:00:00")]

      Date and Time                     Location  Count
96949    2019-01-01  O'Connell St Outside Pennys   1504

# Final section

In [56]:
hourly_df.describe()

              Count
count  4.049610e+05
mean   1.153585e+03
std    2.812098e+03
min    0.000000e+00
25%    1.270000e+02
50%    5.110000e+02
75%    1.376000e+03
max    1.000187e+06

In [57]:
hourly_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 404961 entries, 0 to 404960
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   Date and Time  404961 non-null  datetime64[ns]
 1   Location       404961 non-null  object
 2   Count          404961 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 9.3+ MB

"Calculate the total number of pedestrians counted at the location nearest to "O'Connell Street at Clerys" during March 2010, March 2019 and March 2020."

Note: Used "O'Connell St Outside Clerys" instead of "O'Connell Street at Clerys"

In [58]:
march2010 = hourly_df[(hourly_df.Location == "O'Connell St Outside Clerys") &
                      (hourly_df['Date and Time'].dt.year == 2010) & 
                      (hourly_df['Date and Time'].dt.month == 3)]
march2010.head(5)

            Date and Time                     Location  Count
53020 2010-03-01 00:00:00  O'Connell St Outside Clerys    409
53026 2010-03-01 01:00:00  O'Connell St Outside Clerys    226
53032 2010-03-01 02:00:00  O'Connell St Outside Clerys    237
53038 2010-03-01 03:00:00  O'Connell St Outside Clerys    295
53044 2010-03-01 04:00:00  O'Connell St Outside Clerys    127

In [59]:
march2010.sum()  # 1193089

Location    O'Connell St Outside ClerysO'Connell St Outsid...
Count                                                 1193089
dtype: object

In [60]:
march2019 = hourly_df[(hourly_df.Location == "O'Connell St Outside Clerys") &
                      (hourly_df['Date and Time'].dt.year == 2019) & 
                      (hourly_df['Date and Time'].dt.month == 3)]
march2019.sum()  # 727988

Location    O'Connell St Outside ClerysO'Connell St Outsid...
Count                                                  727988
dtype: object

In [61]:
march2020 = hourly_df[(hourly_df.Location == "O'Connell St Outside Clerys") &
                      (hourly_df['Date and Time'].dt.year == 2020) & 
                      (hourly_df['Date and Time'].dt.month == 3)]
march2020.sum()  # 273164

Location    O'Connell St Outside ClerysO'Connell St Outsid...
Count                                                  274164
dtype: object

Read dataframe into file

In [62]:
hourly_df.to_csv('../data/processed/cleaned-data.csv', index=False)

In [92]:
hourly_df = pd.read_csv('../data/processed/cleaned-data.csv', infer_datetime_format=True, low_memory=False)

### Tackling a3-2008.ods

The openpyxl package lets me deal with the 2008 workbook. My plan is to read the data from the correct rows and columns using excel indexing. I first converted 2008 ods file to xlsx and put this in the "processed" folder for futher use

In [26]:
import openpyxl as xl

In [38]:
wb = xl.load_workbook(filename = '../data/processed/a3-2008.xlsx')

In [119]:
locations = {"O'Connell St Outside Clerys":[],
             "Grafton St at Card Gallery":[],
             "O'Connell Street at Easons": [],
             "Henry Street at Butlers":[],
             "Grafton Street at Korkys":[]}

# for sheet in wb:
#     print(sheet)

groups = [[7, 30], [35, 58], [63, 86], [91, 114], [119, 142], [147, 170]]
def get_block(start, end, letter, ws, l):
    for i in range(start, end+1):
        l.append(ws[letter+str(i)].value)

# columns from sheet to extract
col_letters = ["B", "D", "F", "H", "J", "L", "N"]

for sheet in wb:
    # store the sheet for processing
    ws = wb[sheet.title]
    i = 0
    for key in locations:
        group = groups[i]
        l = []
        
        for letter in col_letters:
            get_block(group[0], group[1], letter, ws, l)
        
        i += 1
        locations[key] += l

whole_2008 = pd.DataFrame(locations)

In [120]:
whole_2008.iloc[150:155, :]

,O'Connell St Outside Clerys,Grafton St at Card Gallery,O'Connell Street at Easons,Henry Street at Butlers,Grafton Street at Korkys
150,112,210,150,85,185
151,177,254,247,123,97
152,191,281,393,133,180
153,273,375,491,211,347
154,589,795,892,630,1062

#### Adding date range to the data

The data still needs a datetime range to match the other datasets. The first monday of 2008 was the 7th. There are 53 weeks in the data rather than 52 meaning the last date is Sunday 11th January 2009 but for sim

In [121]:
dates = pd.date_range(start='2008-1-7', end='2009-01-12', freq="H")
len(dates)

8905

In [122]:
dates=dates[:-1]

In [123]:
whole_2008['Date and Time'] = dates

In [124]:
# rearrange columns
cols = list(whole_2008.columns.values)
dt = cols.pop()
cols.insert(0, dt)

In [139]:
whole_2008 = whole_2008[cols]
whole_2008['Date and Time'] = whole_2008['Date and Time'].astype('object')

In [140]:
whole_2008.head()

,Date and Time,O'Connell St Outside Clerys,Grafton St at Card Gallery,O'Connell Street at Easons,Henry Street at Butlers,Grafton Street at Korkys
0,2008-01-07 00:00:00,0,0,0,0,0
1,2008-01-07 01:00:00,0,0,0,0,0
2,2008-01-07 02:00:00,0,0,0,0,0
3,2008-01-07 03:00:00,0,0,0,0,0
4,2008-01-07 04:00:00,0,0,0,0,0

In [141]:
whole_2008.to_csv('../data/processed/a3-2008-fixed.csv')